Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD100.atdf
      <value-group caption="VBAT Zero-Power BOR Enable bit" name="DEVCFG2__VBATBOREN">
         <value caption="Disable ZPBOR during VBAT Mode" name="OFF" value="0x0" />
         <value caption="Enable ZPBOR during VBAT Mode" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep Zero-Power BOR Enable bit" name="DEVCFG2__DSBOREN">
         <value caption="Disable ZPBOR during deep sleep" name="OFF" value="0x0" />
         <value caption="Enable ZPBOR during deep sleep" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Postscale Select bits" name="DEVCFG2__DSWDTPS">
         <value caption="1:236 (25.7 days)" name="DSPS32" value="0x1f" />
         <value caption="1:235 (12.8 days)" name="DSPS31" value="0x1e" />
         <value caption="1:234 (6.4 days)" name="DSPS30" value="0x1d" />
         <value caption="1:233 (77.0 hours)" name="DSPS29" value="0x1c" />
         <value caption="1:232 (38.5 hours)" name="DSPS28" value="0x1b" />
         <value caption="1:231 (19.2 hours)" name="DSPS27" value="0x1a" />
         <value caption="1:230 (9.6 hours)" name="DSPS26" value="0x19" />
         <value caption="1:229 (4.8 hours)" name="DSPS25" value="0x18" />
         <value caption="1:228 (2.4 hours)" name="DSPS24" value="0x17" />
         <value caption="1:227 (72.2 minutes)" name="DSPS23" value="0x16" />
         <value caption="1:226 (36.1 minutes)" name="DSPS22" value="0x15" />
         <value caption="1:225 (18.0 minutes)" name="DSPS21" value="0x14" />
         <value caption="1:224 (9.0 minutes)" name="DSPS20" value="0x13" />
         <value caption="1:223 (4.5 minutes)" name="DSPS19" value="0x12" />
         <value caption="1:222 (135.3 s)" name="DSPS18" value="0x11" />
         <value caption="1:221 (67.7 s)" name="DSPS17" value="0x10" />
         <value caption="1:220 (33.825 s)" name="DSPS16" value="0xf" />
         <value caption="1:219 (16.912 s)" name="DSPS15" value="0xe" />
         <value caption="1:218 (8.456 s)" name="DSPS14" value="0xd" />
         <value caption="1:217 (4.228 s)" name="DSPS13" value="0xc" />
         <value caption="1:65536 (2.114 s)" name="DSPS12" value="0xb" />
         <value caption="1:32768 (1.057 s)" name="DSPS11" value="0xa" />
         <value caption="1:16384 (528.5 ms)" name="DSPS10" value="0x9" />
         <value caption="1:8192 (264.3 ms)" name="DSPS9" value="0x8" />
         <value caption="1:4096 (132.1 ms)" name="DSPS8" value="0x7" />
         <value caption="1:2048 (66.1 ms)" name="DSPS7" value="0x6" />
         <value caption="1:1024 (33 ms)" name="DSPS6" value="0x5" />
         <value caption="1:512 (16.5 ms)" name="DSPS5" value="0x4" />
         <value caption="1:256 (8.3 ms)" name="DSPS4" value="0x3" />
         <value caption="1:128 (4.1 ms)" name="DSPS3" value="0x2" />
         <value caption="1:64 (2.1 ms)" name="DSPS2" value="0x1" />
         <value caption="1:32 (1 ms)" name="DSPS1" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Reference Clock Select bit" name="DEVCFG2__DSWDTOSC">
         <value caption="Select SOSC as DSWDT Reference Clock" name="SOSC" value="0x0" />
         <value caption="Select LPRC as DSWDT Reference clock" name="LPRC" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Enable bit" name="DEVCFG2__DSWDTEN">
         <value caption="Disable DSWDT during Deep Sleep" name="OFF" value="0x0" />
         <value caption="Enable DSWDT during Deep Sleep" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep Enable bit" name="DEVCFG2__FDSEN">
         <value caption="DS bit (DSCON bit 15) is disabled" name="OFF" value="0x0" />
         <value caption="DS bit (DSCON bit 15) is enabled on a WAIT command" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Brown-out Reset Select Trip Voltage bit" name="DEVCFG2__BORSEL">
         <value caption="BOR trip voltage 2.1V (non-Op amp device operation)" name="HIGH" value="0x1" />
         <value caption="BOR trip voltage 2.8V (Op amp device operation)" name="LOW" value="0x0" />
      </value-group>
      <value-group caption="USB PLL Enable bit" name="DEVCFG2__UPLLEN">
         <value caption="USB PLL is disabled" name="OFF" value="0x1" />
         <value caption="USB PLL is enabled" name="ON" value="0x0" />
      </value-group>
      <value-group caption="Oscillator Selection bits" name="DEVCFG1__FNOSC">
         <value caption="FRC divided by FRCDIV bits" name="FRC" value="0x0" />
         <value caption="System PLL (SPLL Module) (input clock and divider set by SPLLCON)" name="SPLL" value="0x1" />
         <value caption="Primary Osc (HS,EC)" name="POSC" value="0x2" />
         <value caption="USB PLL (UPLL Module) (input clock and divider set by UPLLCON)" name="UPLL" value="0x3" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Low Power RC Oscillator (LPRC)" name="LPRC" value="0x5" />
      </value-group>
      <value-group caption="Deadman Timer Count Window Interval bits" name="DEVCFG1__DMTINTV">
         <value caption="Window/Interval value is zero" name="WIN_0" value="0x0" />
         <value caption="Window/Interval value is 1/2 counter value" name="WIN_1_2" value="0x1" />
         <value caption="Window/Interval value is 3/4 counter value" name="WIN_3_4" value="0x2" />
         <value caption="Window/Interval value is 7/8 counter value" name="WIN_7_8" value="0x3" />
         <value caption="Window/Interval value is 15/16 counter value" name="WIN_15_16" value="0x4" />
         <value caption="Window/Interval value is 31/32 counter value" name="WIN_31_32" value="0x5" />
         <value caption="Window/Interval value is 63/64 counter value" name="WIN_63_64" value="0x6" />
         <value caption="Window/Interval value is 127/128 counter value" name="WIN_127_128" value="0x7" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="DEVCFG1__FSOSCEN">
         <value caption="Disable SOSC" name="OFF" value="0x0" />
         <value caption="Enable SOSC" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Internal External Switchover bit" name="DEVCFG1__IESO">
         <value caption="Internal External Switchover mode is disabled (Two-Speed Start-up is disabled)" name="OFF" value="0x0" />
         <value caption="Internal External Switchover mode is enabled (Two-Speed Start-up is enabled)" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Primary Oscillator Configuration bits" name="DEVCFG1__POSCMOD">
         <value caption="EC mode is selected" name="EC" value="0x0" />
         <value caption="HS Oscillator mode is selected" name="HS" value="0x2" />
         <value caption="POSC is disabled" name="OFF" value="0x3" />
      </value-group>
      <value-group caption="CLKO Enable Configuration bit" name="DEVCFG1__OSCIOFNC">
         <value caption="CLKO output is disabled" name="OFF" value="0x1" />
         <value caption="CLKO output signal active on the OSCO pin" name="ON" value="0x0" />
      </value-group>
      <value-group caption="Clock Switching and Monitoring Selection Configuration bits" name="DEVCFG1__FCKSM">
         <value caption="Software Clock switching is disabled and clock monitoring is disabled" name="CSDCMD" value="0x0" />
         <value caption="Software Clock switching is enabled and clock monitoring is disabled" name="CSECMD" value="0x1" />
         <value caption="Software Clock switching is disabled and clock monitoring is enabled" name="CSDCME" value="0x2" />
         <value caption="Software Clock switching is enabled and clock monitoring is enabled" name="CSECME" value="0x3" />
      </value-group>
      <value-group caption="Watchdog Timer Postscale Select bits" name="DEVCFG1__WDTPS">
         <value caption="1:1" name="PS1" value="0x0" />
         <value caption="1:2" name="PS2" value="0x1" />
         <value caption="1:4" name="PS4" value="0x2" />
         <value caption="1:8" name="PS8" value="0x3" />
         <value caption="1:16" name="PS16" value="0x4" />
         <value caption="1:32" name="PS32" value="0x5" />
         <value caption="1:64" name="PS64" value="0x6" />
         <value caption="1:128" name="PS128" value="0x7" />
         <value caption="1:256" name="PS256" value="0x8" />
         <value caption="1:512" name="PS512" value="0x9" />
         <value caption="1:1024" name="PS1024" value="0xa" />
         <value caption="1:2048" name="PS2048" value="0xb" />
         <value caption="1:4096" name="PS4096" value="0xc" />
         <value caption="1:8192" name="PS8192" value="0xd" />
         <value caption="1:16384" name="PS16384" value="0xe" />
         <value caption="1:32768" name="PS32768" value="0xf" />
         <value caption="1:65536" name="PS65536" value="0x10" />
         <value caption="1:131072" name="PS131072" value="0x11" />
         <value caption="1:262144" name="PS262144" value="0x12" />
         <value caption="1:524288" name="PS524288" value="0x13" />
         <value caption="1:1048576" name="PS1048576" value="0x14" />
      </value-group>
      <value-group caption="Watchdog Timer Stop During Flash Programming bit" name="DEVCFG1__WDTSPGM">
         <value caption="WDT runs during Flash programming" name="RUN" value="0x0" />
         <value caption="WDT stops during Flash programming" name="STOP" value="0x1" />
      </value-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="DEVCFG1__WINDIS">
         <value caption="Watchdog Timer is in non-Window mode" name="NORMAL" value="0x1" />
         <value caption="Watchdog Timer is in Window mode" name="WINDOW" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="DEVCFG1__FWDTEN">
         <value caption="Watchdog Timer is not enabled; it can be enabled in software" name="OFF" value="0x0" />
         <value caption="Watchdog Timer is enabled and cannot be disabled by software" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Watchdog Timer Window Size bits" name="DEVCFG1__FWDTWINSZ">
         <value caption="Window size is 25%" name="WINSZ_25" value="0x3" />
         <value caption="Window size is 37.5%" name="WINSZ_37" value="0x2" />
         <value caption="Window size is 50%" name="WINSZ_50" value="0x1" />
         <value caption="Window size is 75%" name="WINSZ_75" value="0x0" />
      </value-group>
