Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD100.atdf
      <value-group caption="Trigger Source for Conversion of Analog Input AN8 Select bits" name="ADCTRG3__TRGSRC8">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control Variants Only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control Variants Only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control Variants Only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control Variants Only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control Variants Only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control Variants Only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control Variants Only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control Variants Only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control Variants Only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control Variants Only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control Variants Only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control Variants Only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control Variants Only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control Variants Only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN9 Select bits" name="ADCTRG3__TRGSRC9">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control Variants Only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control Variants Only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control Variants Only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control Variants Only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control Variants Only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control Variants Only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control Variants Only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control Variants Only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control Variants Only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control Variants Only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control Variants Only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control Variants Only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control Variants Only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control Variants Only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN10 Select bits" name="ADCTRG3__TRGSRC10">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control Variants Only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control Variants Only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control Variants Only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control Variants Only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control Variants Only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control Variants Only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control Variants Only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control Variants Only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control Variants Only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control Variants Only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control Variants Only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control Variants Only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control Variants Only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control Variants Only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN11 Select bits" name="ADCTRG3__TRGSRC11">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="PWM Generator 6 Current-Limit (Motor Control only)" name="" value="0x1d" />
         <value caption="PWM Generator 5 Current-Limit (Motor Control only)" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 (Rising Edge Only)" name="" value="0x13" />
         <value caption="Output Compare 3 (Rising Edge Only)" name="" value="0x12" />
         <value caption="Output Compare 2 (Rising Edge Only)" name="" value="0x11" />
         <value caption="Output Compare 1 (Rising Edge Only)" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary Special Event trigger (Motor Control only)" name="" value="0x9" />
         <value caption="Primary Special Event trigger (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger (see Note)" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
