Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD100.atdf
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RCON__DMTO">
         <value caption="A DMT time-out has occurred" name="" value="0x1" />
         <value caption="A DMT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset was not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset (MCLR) Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="" value="0x1" />
         <value caption="A Configuration Mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deep Sleep Mode Flag bit" name="RCON__DPSLP">
         <value caption="Deep Sleep mode has occurred" name="" value="0x1" />
         <value caption="Deep Sleep mode has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="VBAT Mode Flag bit" name="RCON__VBAT">
         <value caption="A POR exit from VBAT has occurred (a true POR must be established with the valid VBAT voltage on the VBAT pin)" name="" value="0x1" />
         <value caption="A POR exit from VBAT has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="VBPOR Mode Flag bit" name="RCON__VBPOR">
         <value caption="A VBAT domain POR has occurred" name="" value="0x1" />
         <value caption="A VBAT domain POR has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Core Voltage POR Flag bit" name="RCON__PORCORE">
         <value caption="A Power-up Reset has occurred due to Core Voltage" name="" value="0x1" />
         <value caption="A Power-up Reset has not occurred due to Core Voltage" name="" value="0x0" />
      </value-group>
      <value-group caption="I/O Voltage POR Flag bit" name="RCON__PORIO">
         <value caption="A Power-up Reset has occurred due to I/O Voltage" name="" value="0x1" />
         <value caption="A Power-up Reset has not occurred due to I/O Voltage" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="NMI Reset Counter Value bits" name="RNMICON__NMICNT">
         <value caption="255 SYSCLK cycles before a device Reset occurs" name="" value="0xff" />
         <value caption="254 SYSCLK cycles before a device Reset occurs" name="" value="0xfe" />
         <value caption="1 SYSCLK cycle before a device Reset occurs" name="" value="0x1" />
         <value caption="No delay between NMI assertion and device Reset event" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out in Sleep Mode Flag bit (Setting this bit will cause a WDT NMI)" name="RNMICON__WDTS">
         <value caption="WDT time-out has occurred during Sleep mode and caused a wake-up from sleep" name="" value="0x1" />
         <value caption="WDT time-out has not occurred during Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="" value="0x1" />
         <value caption="FSCM has not detected clock failure" name="" value="0x0" />
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="" value="0x1" />
         <value caption="A general NMI event has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Software NMI Trigger." name="RNMICON__SWNMI">
         <value caption="An NMI will be generated" name="" value="0x1" />
         <value caption="An NMI will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-Out Flag bit" name="RNMICON__WDTO">
         <value caption="WDT time-out has occurred and caused a NMI" name="" value="0x1" />
         <value caption="WDT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RNMICON__DMTO">
         <value caption="DMT time-out has occurred and caused a NMI" name="" value="0x1" />
         <value caption="DMT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Voltage Regulator Stand-by Enable bit" name="PWRCON__VREGS">
         <value caption="Voltage regulator will remain active during Sleep" name="" value="0x1" />
         <value caption="Voltage regulator will go to Stand-by mode during Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO1CON__ROSEL">
         <value name="Reserved" caption="" value="0xF"/>
         <value name="Reserved" caption="" value="0xE"/>
         <value name="Reserved" caption="" value="0xD"/>
         <value name="Reserved" caption="" value="0xC"/>
         <value name="Reserved" caption="" value="0xB"/>
         <value name="Reserved" caption="" value="0xA"/>
         <value name="Reserved" caption="" value="0x9"/>
         <value name="REFCLKI" caption="Reference Clock Input REFCLKI" value="0x8"/>
         <value name="SPLL" caption="System PLL Output SPLL" value="0x7"/>
         <value name="UPLL" caption="UPLL" value="0x6"/>
         <value name="Sosc" caption="Secondary Oscillator SOSC" value="0x5"/>
         <value name="LPRC" caption="Low Power Oscillator LPRC" value="0x4"/>
         <value name="FRC" caption="Internal Fast Oscillator FRC" value="0x3"/>
         <value name="Posc" caption="Primary Oscillator POSC" value="0x2"/>
         <value name="PBCLK1" caption="Peripheral Clock 1 PBCLK1" value="0x1"/>
         <value name="SYSCLK" caption="System clock SYSCLK" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO1CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO1CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO1CON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
