Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD100.atdf
      <value-group caption="Data EEPROM Power Control bit" name="EECON__ON">
         <value caption="Data EEPROM is enabled" name="" value="0x1" />
         <value caption="Data EEPROM is disabled" name="" value="0x0" />
      </value-group>
    </module>
   <module caption="" id="02467" name="GPIO" version="1">
      <register-group name="GPIO">
         <register caption="" name="ANSELA" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSA0" />
            <bitfield mask="0x00000002" name="ANSA1" />
            <bitfield mask="0x00000010" name="ANSA4" />
            <bitfield mask="0x00000100" name="ANSA8" />
            <bitfield mask="0x00000800" name="ANSA11" />
            <bitfield mask="0x00001000" name="ANSA12" />
            <bitfield mask="0x00004000" name="ANSA14" />
            <bitfield mask="0x00008000" name="ANSA15" />
         </register>
         <register caption="" name="ANSELB" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSB0" />
            <bitfield mask="0x00000002" name="ANSB1" />
            <bitfield mask="0x00000004" name="ANSB2" />
            <bitfield mask="0x00000008" name="ANSB3" />
            <bitfield mask="0x00000080" name="ANSB7" />
            <bitfield mask="0x00000200" name="ANSB9" />
         </register>
         <register caption="" name="ANSELC" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSC0" />
            <bitfield mask="0x00000002" name="ANSC1" />
            <bitfield mask="0x00000004" name="ANSC2" />
            <bitfield mask="0x00000400" name="ANSC10" />
            <bitfield mask="0x00000800" name="ANSC11" />
            <bitfield mask="0x00001000" name="ANSC12" />
         </register>
         <register caption="" name="ANSELD" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x00004000" name="ANSD14" />
            <bitfield mask="0x00008000" name="ANSD15" />
         </register>
         <register caption="" name="ANSELE" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSE0" />
            <bitfield mask="0x00000002" name="ANSE1" />
            <bitfield mask="0x00000100" name="ANSE8" />
            <bitfield mask="0x00000200" name="ANSE9" />
            <bitfield mask="0x00001000" name="ANSE12" />
            <bitfield mask="0x00002000" name="ANSE13" />
            <bitfield mask="0x00004000" name="ANSE14" />
            <bitfield mask="0x00008000" name="ANSE15" />
         </register>
         <register caption="" name="ANSELF" offset="0x500" rw="RW" size="4">
            <bitfield mask="0x00000020" name="ANSF5" />
            <bitfield mask="0x00000200" name="ANSF9" />
            <bitfield mask="0x00000400" name="ANSF10" />
            <bitfield mask="0x00001000" name="ANSF12" />
            <bitfield mask="0x00002000" name="ANSF13" />
         </register>
         <register caption="" name="ANSELG" offset="0x600" rw="RW" size="4">
            <bitfield mask="0x00000040" name="ANSG6" />
            <bitfield mask="0x00000080" name="ANSG7" />
            <bitfield mask="0x00000100" name="ANSG8" />
            <bitfield mask="0x00000200" name="ANSG9" />
            <bitfield mask="0x00000400" name="ANSG10" />
            <bitfield mask="0x00000800" name="ANSG11" />
            <bitfield mask="0x00008000" name="ANSG15" />
         </register>
         <register caption="" name="TRISA" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISA0" />
            <bitfield mask="0x00000002" name="TRISA1" />
            <bitfield mask="0x00000010" name="TRISA4" />
            <bitfield mask="0x00000080" name="TRISA7" />
            <bitfield mask="0x00000100" name="TRISA8" />
            <bitfield mask="0x00000800" name="TRISA11" />
            <bitfield mask="0x00001000" name="TRISA12" />
            <bitfield mask="0x00004000" name="TRISA14" />
            <bitfield mask="0x00008000" name="TRISA15" />
         </register>
         <register caption="" name="TRISB" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISB0" />
            <bitfield mask="0x00000002" name="TRISB1" />
            <bitfield mask="0x00000004" name="TRISB2" />
            <bitfield mask="0x00000008" name="TRISB3" />
            <bitfield mask="0x00000010" name="TRISB4" />
            <bitfield mask="0x00000020" name="TRISB5" />
            <bitfield mask="0x00000040" name="TRISB6" />
            <bitfield mask="0x00000080" name="TRISB7" />
            <bitfield mask="0x00000100" name="TRISB8" />
            <bitfield mask="0x00000200" name="TRISB9" />
            <bitfield mask="0x00000400" name="TRISB10" />
            <bitfield mask="0x00000800" name="TRISB11" />
            <bitfield mask="0x00001000" name="TRISB12" />
            <bitfield mask="0x00002000" name="TRISB13" />
            <bitfield mask="0x00004000" name="TRISB14" />
            <bitfield mask="0x00008000" name="TRISB15" />
         </register>
         <register caption="" name="TRISC" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISC0" />
            <bitfield mask="0x00000002" name="TRISC1" />
            <bitfield mask="0x00000004" name="TRISC2" />
            <bitfield mask="0x00000040" name="TRISC6" />
            <bitfield mask="0x00000080" name="TRISC7" />
            <bitfield mask="0x00000100" name="TRISC8" />
            <bitfield mask="0x00000200" name="TRISC9" />
            <bitfield mask="0x00000400" name="TRISC10" />
            <bitfield mask="0x00000800" name="TRISC11" />
            <bitfield mask="0x00001000" name="TRISC12" />
            <bitfield mask="0x00002000" name="TRISC13" />
            <bitfield mask="0x00004000" name="TRISC14" />
            <bitfield mask="0x00008000" name="TRISC15" />
         </register>
         <register caption="" name="TRISD" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000002" name="TRISD1" />
            <bitfield mask="0x00000004" name="TRISD2" />
            <bitfield mask="0x00000008" name="TRISD3" />
            <bitfield mask="0x00000010" name="TRISD4" />
            <bitfield mask="0x00000020" name="TRISD5" />
            <bitfield mask="0x00000040" name="TRISD6" />
            <bitfield mask="0x00000100" name="TRISD8" />
            <bitfield mask="0x00001000" name="TRISD12" />
            <bitfield mask="0x00002000" name="TRISD13" />
            <bitfield mask="0x00004000" name="TRISD14" />
            <bitfield mask="0x00008000" name="TRISD15" />
         </register>
         <register caption="" name="TRISE" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISE0" />
            <bitfield mask="0x00000002" name="TRISE1" />
            <bitfield mask="0x00000100" name="TRISE8" />
            <bitfield mask="0x00000200" name="TRISE9" />
            <bitfield mask="0x00001000" name="TRISE12" />
            <bitfield mask="0x00002000" name="TRISE13" />
            <bitfield mask="0x00004000" name="TRISE14" />
            <bitfield mask="0x00008000" name="TRISE15" />
         </register>
         <register caption="" name="TRISF" offset="0x510" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISF0" />
            <bitfield mask="0x00000002" name="TRISF1" />
            <bitfield mask="0x00000020" name="TRISF5" />
            <bitfield mask="0x00000040" name="TRISF6" />
            <bitfield mask="0x00000080" name="TRISF7" />
            <bitfield mask="0x00000200" name="TRISF9" />
            <bitfield mask="0x00000400" name="TRISF10" />
            <bitfield mask="0x00001000" name="TRISF12" />
            <bitfield mask="0x00002000" name="TRISF13" />
         </register>
         <register caption="" name="TRISG" offset="0x610" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISG0" />
            <bitfield mask="0x00000002" name="TRISG1" />
            <bitfield mask="0x00000040" name="TRISG6" />
            <bitfield mask="0x00000080" name="TRISG7" />
            <bitfield mask="0x00000100" name="TRISG8" />
            <bitfield mask="0x00000200" name="TRISG9" />
            <bitfield mask="0x00000400" name="TRISG10" />
            <bitfield mask="0x00000800" name="TRISG11" />
            <bitfield mask="0x00001000" name="TRISG12" />
            <bitfield mask="0x00002000" name="TRISG13" />
            <bitfield mask="0x00004000" name="TRISG14" />
            <bitfield mask="0x00008000" name="TRISG15" />
         </register>
