Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD100.atdf
         <register caption="" name="SRCON1B" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000010" name="SR1B4" />
            <bitfield mask="0x00000040" name="SR1B6" />
            <bitfield mask="0x00000080" name="SR1B7" />
            <bitfield mask="0x00000400" name="SR1B10" />
            <bitfield mask="0x00000800" name="SR1B11" />
            <bitfield mask="0x00001000" name="SR1B12" />
            <bitfield mask="0x00002000" name="SR1B13" />
            <bitfield mask="0x00004000" name="SR1B14" />
            <bitfield mask="0x00008000" name="SR1B15" />
         </register>
         <register caption="" name="SRCON1C" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0x00000040" name="SR1C6" />
            <bitfield mask="0x00000080" name="SR1C7" />
            <bitfield mask="0x00000100" name="SR1C8" />
            <bitfield mask="0x00000200" name="SR1C9" />
            <bitfield mask="0x00000800" name="SR1C11" />
            <bitfield mask="0x00008000" name="SR1C15" />
         </register>
         <register caption="" name="SRCON1D" offset="0x3d0" rw="RW" size="4">
            <bitfield mask="0x00000002" name="SR1D1" />
            <bitfield mask="0x00000004" name="SR1D2" />
            <bitfield mask="0x00000008" name="SR1D3" />
            <bitfield mask="0x00000010" name="SR1D4" />
            <bitfield mask="0x00000020" name="SR1D5" />
            <bitfield mask="0x00000040" name="SR1D6" />
            <bitfield mask="0x00000100" name="SR1D8" />
         </register>
         <register caption="" name="SRCON1E" offset="0x4d0" rw="RW" size="4">
            <bitfield mask="0x00001000" name="SR1E12" />
            <bitfield mask="0x00002000" name="SR1E13" />
            <bitfield mask="0x00004000" name="SR1E14" />
            <bitfield mask="0x00008000" name="SR1E15" />
         </register>
         <register caption="" name="SRCON1F" offset="0x5d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SR1F0" />
            <bitfield mask="0x00000002" name="SR1F1" />
         </register>
      </register-group>
      <value-group caption="Change Notification Style bit" name="CNCONA__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONA__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONB__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONB__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONC__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONC__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCOND__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCOND__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONE__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONE__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONF__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONF__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONG__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONG__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
   </module>
