Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD100.atdf
         <register caption="Timer Configuration" name="T3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T3CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T3CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T3CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T3CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T3CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T3CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T3CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T4CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T4CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T4CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T4CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T4CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T4CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T4CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T5CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T5CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T5CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T5CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T5CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T5CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T5CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T5CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T6CON" offset="0xa00" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T6CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T6CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T6CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T6CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T6CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T6CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T6CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T7CON" offset="0xc00" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T7CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T7CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T7CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T7CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T7CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T7CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T7CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T8CON" offset="0xe00" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T8CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T8CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T8CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T8CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T8CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T8CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T8CON__ON" />
         </register>
         <register caption="Timer Configuration" name="T9CON" offset="0x1000" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T9CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T9CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T9CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T9CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T9CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T9CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T9CON__ON" />
         </register>
         <register caption="Timer" name="TMR2" offset="0x210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR2" />
         </register>
         <register caption="Timer" name="TMR3" offset="0x410" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR3" />
         </register>
