Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK_DFP/0.1/PIC32MK/atdf/PIC32MK1024GPD100.atdf
      <value-group caption="Transmit Polarity Inversion bit" name="U6STA__UTXINV">
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 0 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 1" name="" value="0x1" />
         <value caption="(If IrDA mode is disabled) UxTX Idle state is 1 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="TX Interrupt Mode Selection bits" name="U6STA__UTXISEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt is generated and asserted while the transmit buffer is empty" name="" value="0x2" />
         <value caption="Interrupt is generated and asserted when all characters have been transmitted" name="" value="0x1" />
         <value caption="Interrupt is generated and asserted while the transmit buffer contains at least one empty space" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Address Match Mask bits" name="U6STA__MASK">
         <value caption="Corresponding ADDRx bits are used to detect the address match" name="" value="0x1fe" />
         <value caption="Corresponding ADDRx bits are not used to detect the address match." name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02813" name="USB" version="3">
      <register-group name="USB">
         <register caption="USB OTG Interrupt Status Register (x = 1 and 2)" name="U1OTGIR" offset="0x0" rw="RW" size="4">
            <bitfield caption="A-Device" mask="0x00000001" name="VBUSVDIF" values="U1OTGIR__VBUSVDIF" />
            <bitfield caption="B-Device" mask="0x00000004" name="SESENDIF" values="U1OTGIR__SESENDIF" />
            <bitfield caption="Session Valid Change Indicator bit" mask="0x00000008" name="SESVDIF" values="U1OTGIR__SESVDIF" />
            <bitfield caption="Bus Activity Indicator bit" mask="0x00000010" name="ACTVIF" values="U1OTGIR__ACTVIF" />
            <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATEIF" values="U1OTGIR__LSTATEIF" />
            <bitfield caption="1 Millisecond Timer bit" mask="0x00000040" name="T1MSECIF" values="U1OTGIR__T1MSECIF" />
            <bitfield caption="ID State Change Indicator bit" mask="0x00000080" name="IDIF" values="U1OTGIR__IDIF" />
         </register>
         <register caption="USB OTG Interrupt Status Register (x = 1 and 2)" name="U2OTGIR" offset="0x1000" rw="RW" size="4">
            <bitfield caption="A-Device" mask="0x00000001" name="VBUSVDIF" values="U2OTGIR__VBUSVDIF" />
            <bitfield caption="B-Device" mask="0x00000004" name="SESENDIF" values="U2OTGIR__SESENDIF" />
            <bitfield caption="Session Valid Change Indicator bit" mask="0x00000008" name="SESVDIF" values="U2OTGIR__SESVDIF" />
            <bitfield caption="Bus Activity Indicator bit" mask="0x00000010" name="ACTVIF" values="U2OTGIR__ACTVIF" />
            <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATEIF" values="U2OTGIR__LSTATEIF" />
            <bitfield caption="1 Millisecond Timer bit" mask="0x00000040" name="T1MSECIF" values="U2OTGIR__T1MSECIF" />
            <bitfield caption="ID State Change Indicator bit" mask="0x00000080" name="IDIF" values="U2OTGIR__IDIF" />
         </register>
         <register caption="USB OTG Interrupt Enable Register (x = 1 and 2)" name="U1OTGIE" offset="0x10" rw="RW" size="4">
            <bitfield caption="A- Vbus Valid Interrupt Enable bit" mask="0x00000001" name="VBUSVDIE" values="U1OTGIE__VBUSVDIE" />
            <bitfield caption="B-Session End Interrupt Enable bit" mask="0x00000004" name="SESENDIE" values="U1OTGIE__SESENDIE" />
            <bitfield caption="Session Valid Interrupt Enable bit" mask="0x00000008" name="SESVDIE" values="U1OTGIE__SESVDIE" />
            <bitfield caption="Bus Activity Interrupt Enable bit" mask="0x00000010" name="ACTVIE" values="U1OTGIE__ACTVIE" />
            <bitfield caption="Line State Interrupt Enable bit" mask="0x00000020" name="LSTATEIE" values="U1OTGIE__LSTATEIE" />
            <bitfield caption="1 Millisecond Timer Interrupt Enable bit" mask="0x00000040" name="T1MSECIE" values="U1OTGIE__T1MSECIE" />
            <bitfield caption="ID Interrupt Enable bit" mask="0x00000080" name="IDIE" values="U1OTGIE__IDIE" />
         </register>
         <register caption="USB OTG Interrupt Enable Register (x = 1 and 2)" name="U2OTGIE" offset="0x1010" rw="RW" size="4">
            <bitfield caption="A- Vbus Valid Interrupt Enable bit" mask="0x00000001" name="VBUSVDIE" values="U2OTGIE__VBUSVDIE" />
            <bitfield caption="B-Session End Interrupt Enable bit" mask="0x00000004" name="SESENDIE" values="U2OTGIE__SESENDIE" />
            <bitfield caption="Session Valid Interrupt Enable bit" mask="0x00000008" name="SESVDIE" values="U2OTGIE__SESVDIE" />
            <bitfield caption="Bus Activity Interrupt Enable bit" mask="0x00000010" name="ACTVIE" values="U2OTGIE__ACTVIE" />
            <bitfield caption="Line State Interrupt Enable bit" mask="0x00000020" name="LSTATEIE" values="U2OTGIE__LSTATEIE" />
            <bitfield caption="1 Millisecond Timer Interrupt Enable bit" mask="0x00000040" name="T1MSECIE" values="U2OTGIE__T1MSECIE" />
            <bitfield caption="ID Interrupt Enable bit" mask="0x00000080" name="IDIE" values="U2OTGIE__IDIE" />
         </register>
         <register caption="USB OTG Status Register (x = 1 and 2)" name="U1OTGSTAT" offset="0x20" rw="RW" size="4">
            <bitfield caption="A-Device Vbus Valid Indicator bit" mask="0x00000001" name="VBUSVD" values="U1OTGSTAT__VBUSVD" />
            <bitfield caption="B-Device Session End Indicator bit" mask="0x00000004" name="SESEND" values="U1OTGSTAT__SESEND" />
            <bitfield caption="Session Valid Indicator bit" mask="0x00000008" name="SESVD" values="U1OTGSTAT__SESVD" />
            <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATE" values="U1OTGSTAT__LSTATE" />
            <bitfield caption="ID Pin State Indicator bit" mask="0x00000080" name="ID" values="U1OTGSTAT__ID" />
         </register>
